In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [ ]:
#loading the dataset
dataset = pd.read_csv('Churn_Modelling.csv')
dataset1 = pd.read_csv('Churn_Modelling.csv')

In [ ]:
#to load the data
dataset.head(10)

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0
5          6    15574012       Chu  ...               0       149756.71      1
6          7    15592531  Bartlett  ...               1        10062.80      0
7          8    15656148    Obinna  ...               0       119346.88      1
8          9    15792365        He  ...               1        74940.50      0
9         10    15592389        H?  ...               1        71725.73      0

[10 rows x 14 columns]

In [ ]:
dataset = dataset.iloc[:,3:]

In [ ]:
#to check for missing values
dataset.isnull().sum

<bound method DataFrame.sum of       CreditScore  Geography  Gender  ...  IsActiveMember  EstimatedSalary  Exited
0           False      False   False  ...           False            False   False
1           False      False   False  ...           False            False   False
2           False      False   False  ...           False            False   False
3           False      False   False  ...           False            False   False
4           False      False   False  ...           False            False   False
...           ...        ...     ...  ...             ...              ...     ...
9995        False      False   False  ...           False            False   False
9996        False      False   False  ...           False            False   False
9997        False      False   False  ...           False            False   False
9998        False      False   False  ...           False            False   False
9999        False      False   False  ...           False            False   False

[10000 rows x 11 columns]>

In [ ]:
#to check rows and coloumns of the dataset
np.shape(dataset)

(10000, 11)

In [ ]:
dataset.iloc[:,1]

0        France
1         Spain
2        France
3        France
4         Spain
         ...
9995     France
9996     France
9997     France
9998    Germany
9999     France
Name: Geography, Length: 10000, dtype: object

In [ ]:
#encoding categorical data
dataset_country = dataset.iloc[:,1]
def encode_country(country):
  if country== 'France':
    return 0
  elif country=='Spain' :
    return 1
  elif country=='Germany' :
    return 2
  
dataset_country = list(map(encode_country,dataset_country))

In [ ]:

dataset.iloc[:,1]

0        France
1         Spain
2        France
3        France
4         Spain
         ...
9995     France
9996     France
9997     France
9998    Germany
9999     France
Name: Geography, Length: 10000, dtype: object

In [ ]:
#splitting the dataset into ytrainset and test set
x = dataset.iloc[:,:-1].values
y = dataset.iloc[:,-1].values

In [ ]:

from sklearn.model_selection import train_test_split as tts 
x_train, x_test, y_train, y_test = tts(x,y,test_size=0.3,random_state=0)

In [ ]:
print(np.shape(x_train))
print(np.shape(x_test))

(7000, 10)
(3000, 10)

In [ ]:
dataset.describe()

        CreditScore           Age  ...  EstimatedSalary        Exited
count  10000.000000  10000.000000  ...     10000.000000  10000.000000
mean     650.528800     38.921800  ...    100090.239881      0.203700
std       96.653299     10.487806  ...     57510.492818      0.402769
min      350.000000     18.000000  ...        11.580000      0.000000
25%      584.000000     32.000000  ...     51002.110000      0.000000
50%      652.000000     37.000000  ...    100193.915000      0.000000
75%      718.000000     44.000000  ...    149388.247500      0.000000
max      850.000000     92.000000  ...    199992.480000      1.000000

[8 rows x 9 columns]

In [ ]:
from sklearn.preprocessing import StandardScaler
std_scaler = StandardScaler()
x_train.age = np.array(x_train[:,3])
x_train[:,3] = std_scaler.fit_transform(x_train.age)

TypeError: ignored

In [ ]:
#def scale_age(age):




dataset.columns

Index(['CreditScore', 'Geography', 'Gender', 'Age', 'Tenure', 'Balance',
       'NumOfProducts', 'HasCrCard', 'IsActiveMember', 'EstimatedSalary',
       'Exited'],
      dtype='object')

In [ ]:
#dataset_age = dataset['Age']
dataset.age.head

<bound method NDFrame.head of 0       42
1       41
2       42
3       39
4       43
        ..
9995    39
9996    35
9997    36
9998    42
9999    28
Name: Age, Length: 10000, dtype: int64>